{
  "ui": {
    "tap_to_say": "Tap to Say",
    "type_placeholder": "Type your request...",
    "grow_business": "Grow My Business",
    "get_website": "Get a Website",
    "login": "Cloudora Login",
    "apply": "Apply",
    "listen_start": "Listening...",
    "listen_failed": "Couldn't hear you. Try again."
  },
  "genie": {
    "welcome": "Hello! How can I help you today?",
    "fallback": "Okay! How can I support you further?",
    "lead_created": "Thanks — I captured your request. Our expert will contact you soon.",
    "lead_error": "Sorry, failed to save your request. Try again later."
  },
  "flow": {
    "website": {
      "q1": "What type of website do you need? (Business / E-commerce / Portfolio / Landing)",
      "q2": "How many pages do you expect?",
      "q3": "Do you already have the content (text/images)?",
      "q4": "Any special features required? (payment, booking, login)",
      "q5": "What's your budget range?",
      "q6": "Please share your contact (phone or email) so we can reach you."
    },
    "business": {
      "q1": "Which category best fits your business? (Real Estate / Restaurants / Retail / E-commerce / Other)",
      "q2": "What is the main problem you'd like us to solve?",
      "q3": "Which service are you most interested in? (Leads / Website / Marketing / Hiring)",
      "q4": "What's your budget or monthly spend range?",
      "q5": "Please share your contact (phone/email) so we can send a tailored plan."
    },
    "job": {
      "q1": "Which role are you applying for? (Telecaller / Sales / Technical / Creative)",
      "q2": "How much experience do you have?",
      "q3": "Are you available full-time or part-time?",
      "q4": "What is your expected payout or salary?",
      "q5": "Please share your contact (phone/email) for the application."
    }
  },
  "pitch": {
    "real_estate": "Real estate grows with leads. Cloudora helps you get genuine buyer and seller enquiries, strong online visibility, and telecallers or CRM to support your follow-ups.",
    "restaurants": "Cloudora helps restaurants increase walk-ins and online orders through marketing, Google ranking, and promotions, and we even support manpower like chefs and waiters.",
    "local_services": "We bring you daily clients and local leads through targeted local ads, Google business listing, and WhatsApp outreach.",
    "retail": "Cloudora helps retail shops with local visibility, store promotions, and online catalogs to increase footfall and sales.",
    "startups": "Cloudora becomes your full growth partner—branding, marketing, website, manpower, client acquisition, and training—everything to grow your idea.",
    "education": "We help institutions get more admission enquiries through targeted campaigns, landing pages, and CRM follow-ups.",
    "ecommerce": "We boost online orders with performance ads, product creatives, catalog optimization and automated remarketing.",
    "health": "Cloudora brings more appointments and memberships through local promotion, SEO and appointment automation.",
    "automobile": "We generate buyer enquiries and test-drive bookings with local ads and CRM follow-up.",
    "travel": "We improve your booking enquiries through targeted campaigns, landing pages, and automation.",
    "beauty": "We bring more bookings and increase your online reputation through local ads and promotions.",
    "finance": "We drive qualified leads for insurance, loans and advisors with targeted marketing and CRM funnels.",
    "manufacturing": "We promote B2B buyer leads and distributor enquiries with product catalogs and targeted outreach.",
    "freelancer": "We help freelancers find high-value clients through portfolio websites and targeted campaigns.",
    "logistics": "We bring more bookings and local visibility through Google Maps optimization and lead campaigns.",
    "homeservices": "Hyperlocal campaigns for plumbers, electricians, and technicians to increase daily service calls."
  }
}
