{
  "module": "demand_rules",
  "version": "2.0",
  "documents": [

    {
      "id": "demand_tracking_overview",
      "title": "Enquiry Tracking System",
      "content": "Cloudora tracks all product enquiries to understand demand patterns and pricing optimisation opportunities. Tracked fields include product_id, user_location, detected_budget, contact_time, intent and source. Enquiries are retained for 365 days for strategic analytics and pricing recommendations."
    },

    {
      "id": "demand_tracking_fields",
      "title": "Fields Used for Demand Tracking",
      "content": "The enquiry tracking framework evaluates: product_id, user_location, detected_budget, contact_time, user_intent and source channel. These fields help Cloudora determine interest trends, pricing elasticity and workload forecasting."
    },

    {
      "id": "rule_increase_typical_range",
      "title": "Demand Rule: Increase Typical Range",
      "content": "If enquiries for a product increase by 20% within 30 days, Cloudora recommends increasing the typical pricing range by 10%. This ensures pricing adjusts with rising market demand and team workload."
    },

    {
      "id": "rule_decrease_typical_range",
      "title": "Demand Rule: Decrease Typical Range",
      "content": "If conversion rates drop by 10% within 30 days, Cloudora recommends decreasing the typical pricing range by 10% to improve competitiveness and boost conversions."
    },

    {
      "id": "rule_increase_minimum_price",
      "title": "Demand Rule: Increase Minimum Price",
      "content": "If team workload increases by 30% within 30 days, Cloudora suggests increasing the minimum price by 10% to maintain delivery quality and load balancing."
    },

    {
      "id": "demand_rule_governance",
      "title": "Pricing Update Governance",
      "content": "All pricing suggestions generated by demand rules require admin approval before being applied. Notifications are sent to the admin dashboard, email and Slack (if enabled). No price update happens automatically without review."
    },

    {
      "id": "analytics_overview",
      "title": "Demand Analytics Overview",
      "content": "Cloudora performs analytics on daily, weekly and monthly windows. Key tracked metrics include new enquiries, conversion rates, average detected budget and top products by demand. Weekly windows are used as the default analysis period."
    },

    {
      "id": "admin_dashboard_features",
      "title": "Admin Dashboard for Pricing Suggestions",
      "content": "The admin dashboard includes a suggestion review page at /admin/pricing-suggestions, enables admin approval, auto-application after approval and logs all pricing decisions for auditing."
    },

    {
      "id": "role_based_access",
      "title": "Role-based Pricing Access",
      "content": "Telecaller: can view product name and brief minimum price only. Sales Executive: can view typical ranges but not internal data. Senior Sales: can view minimum, typical, premium and margin hints but cannot edit. Admin: full visibility and edit rights including approval of automated pricing suggestions."
    },

    {
      "id": "recommendation_logic",
      "title": "Budget-Based Recommendation Logic",
      "content": "Genie recommends services based on detected budget ranges, enquiry intent and historic conversion data. Genie follows business logic: never reveal internal margin hints, always provide ranges privately, always redirect pricing conversations to discovery questions and budget validation."
    }

  ]
}
