{
  "module": "training",
  "version": "3.0",
  "documents": [

    {
      "id": "training_overview",
      "title": "Cloudora Employee Training Overview",
      "category": "training",
      "content": "Cloudora provides structured training for Telecalling, Sales, CRM, Marketing, Creative, Development, Support, and Administration. Genie acts as the training assistant, giving scripts, workflows, best practices, assessments, and continuous guidance.",
      "metadata": {
        "departments": [
          "telecalling", "sales", "crm",
          "marketing", "creative", "development",
          "support", "admin"
        ]
      }
    },

    {
      "id": "training_telecalling_intro",
      "title": "Telecalling Training Introduction",
      "category": "training",
      "content": "Telecallers must understand: lead collection, requirement identification, CRM notes, professional communication, objection handling, and disciplined follow-ups. Training includes tone control, voice clarity, active listening, and structured questioning.",
      "metadata": {}
    },

    {
      "id": "training_telecalling_key_points",
      "title": "Telecalling Key Training Points",
      "category": "training",
      "content": "Key telecalling skills: ask structured questions, avoid rushing, collect full details, maintain CRM accuracy, positive tone, stay calm, avoid arguments, handle objections politely, follow daily targets, and complete follow-ups on time.",
      "metadata": {}
    },

    {
      "id": "training_sales_intro",
      "title": "Sales Training Introduction",
      "category": "training",
      "content": "Sales training includes: requirement discovery, value pitching, pricing frameworks, timeline explanation, objection handling, proposal preparation, negotiation within guardrails, and confident closing.",
      "metadata": {}
    },

    {
      "id": "training_sales_best_practices",
      "title": "Sales Best Practices",
      "category": "training",
      "content": "Best practices: listen before pitching, ask discovery questions, explain benefits clearly, avoid overselling, highlight deliverables, follow-up consistently, create polite urgency, document everything, and maintain transparency.",
      "metadata": {}
    },

    {
      "id": "training_crm_usage",
      "title": "CRM Usage Training",
      "category": "training",
      "content": "Employees must update CRM after every call, change lead status properly, add detailed notes, upload documents, track progress, and ensure follow-up schedules. Genie guides employees on CRM stages and expected actions.",
      "metadata": {}
    },

    {
      "id": "training_marketing_team",
      "title": "Marketing Team Training",
      "category": "training",
      "content": "Marketing training covers: content creation, branding rules, visual style, content calendars, ad creatives, analytics interpretation, and monthly reporting. Team must follow brand tone and scheduled output.",
      "metadata": {}
    },

    {
      "id": "training_creative_team",
      "title": "Creative Team Training",
      "category": "training",
      "content": "Creative training includes design principles, storytelling, color psychology, typography, motion basics, editing structure, and visual communication. Deadlines, quality consistency, and brief adherence are emphasized.",
      "metadata": {}
    },

    {
      "id": "training_development_team",
      "title": "Development Team Training",
      "category": "training",
      "content": "Development training covers coding standards, documentation, Git workflow, deployments, API communication, database management, testing, and security rules. Developers must produce clean, maintainable, optimized code.",
      "metadata": {}
    },

    {
      "id": "training_support_team",
      "title": "Support Team Training",
      "category": "training",
      "content": "Support team training includes issue classification, SLA rules, troubleshooting basics, communication etiquette, escalation flow, and ticket documentation. Response must be fast, polite, and aligned with SLA priorities.",
      "metadata": {}
    },

    {
      "id": "training_productivity",
      "title": "Productivity & Time Management Training",
      "category": "training",
      "content": "Training includes prioritization, deadline management, reducing delays, clear communication, and maintaining daily task lists. Genie assists employees with reminders, workflows, and structured planning.",
      "metadata": {}
    },

    {
      "id": "training_onboarding_module",
      "title": "Employee Onboarding Module",
      "category": "training",
      "content": "New employees learn Cloudora values, services, CRM basics, communication rules, department workflows, training flow, assessment process, and how to use Genie for guidance.",
      "metadata": {}
    },

    {
      "id": "training_modules_detailed",
      "title": "Detailed Department Training Modules",
      "category": "training",
      "content": "This contains structured multi-hour training modules for Telecalling, Sales, Technical Development, and Soft Skills.",
      "metadata": {
        "tone": "friendly_motivational",
        "modules": {
          "telecaller_module": {
            "duration_hours": 6,
            "topics": [
              "Intro to Cloudora",
              "Product quick-sell scripts",
              "Qualification checklist",
              "CRM usage",
              "Compliance"
            ],
            "assessment": "roleplay + quiz"
          },
          "sales_module": {
            "duration_hours": 8,
            "topics": [
              "Consultative selling",
              "Proposal generation",
              "Negotiation guardrails",
              "Objection handling",
              "Quote tool usage"
            ],
            "assessment": "mock_call + proposal task"
          },
          "technical_onboarding": {
            "duration_hours": 12,
            "topics": [
              "Development environment setup",
              "Deployment process",
              "Ticketing workflow",
              "Code review basics"
            ],
            "assessment": "practical coding task"
          },
          "soft_skills": {
            "duration_hours": 4,
            "topics": [
              "communication",
              "time management",
              "client empathy"
            ],
            "delivery": "interactive session"
          }
        },
        "certification": "Internal certificate stored in Supabase table employee_certificates"
      }
    }

  ]
}
