{
  "module": "crm",
  "version": "2.0",
  "documents": [
    {
      "id": "crm_overview",
      "title": "CRM System Overview",
      "content": "Cloudora CRM manages the complete lifecycle of leads, customers, and job applicants. The CRM connects marketing, sales, telecalling, onboarding, delivery, support and renewal into one structured workflow. Genie interacts with all CRM phases and guides users internally and externally with clarity and professionalism."
    },
    {
      "id": "crm_pipelines",
      "title": "CRM Pipelines",
      "content": "Cloudora operates two main pipeline categories: 1) Business Lead Pipeline: New, Contacted, Proposal Sent, Negotiation, Won, Lost. 2) Job Application Pipeline: Applied, Screening, Interview, Offer, Onboarded, Rejected. Each pipeline includes required actions, communication guidelines, and responsible team roles."
    },
    {
      "id": "crm_lead_definition",
      "title": "Definition of a Business Lead",
      "content": "A lead is any person or company showing interest in Cloudora services through website, WhatsApp, Genie, advertising, referrals, social media, or internal outreach. Every valid lead must contain name, phone, email, city, requirement, and budget context. Genie automatically creates leads via conversational onboarding."
    },
    {
      "id": "crm_lead_fields",
      "title": "Lead Fields Schema",
      "content": "Core lead fields include: name, phone, email, city, business_name, product_interest, requirement, detected_budget, timeline, source, note, assigned_to, created_at. Genie should always request requirement + budget before recommending plans."
    },
    {
      "id": "crm_lead_qualification",
      "title": "Lead Qualification Rules",
      "content": "Cloudora qualifies leads based on requirement clarity, seriousness, timeline, budget, and decision-maker availability. Leads are categorized into Hot, Warm, or Cold. Hot leads require immediate follow-ups from Sales. Cold leads go into nurturing flows managed by telecalling and automated reminders."
    },
    {
      "id": "crm_lead_process",
      "title": "Lead Handling Process",
      "content": "Step 1: Genie or telecaller collects requirement and budget. Step 2: Sales verifies details and consults the client. Step 3: Proposal or plan is prepared. Step 4: Agreement is issued. Step 5: Payment stage. Step 6: Customer onboarding. Genie assists by keeping track of missing information and maintaining clarity."
    },
    {
      "id": "crm_job_application_overview",
      "title": "Job Application CRM Overview",
      "content": "Job applicants follow a structured workflow: Application → Screening → Interview → Offer → Onboarding. Genie collects applicant details, required documents and preferences, and logs applications into Supabase for HR processing."
    },
    {
      "id": "crm_job_application_fields",
      "title": "Job Application Fields Schema",
      "content": "Job application fields include: name, phone, email, city, interested_department, preferred_role, experience_years, languages, resume_link, expected_ctc, preferred_shift, work_hours, department_notes, created_at."
    },
    {
      "id": "crm_assignment_rules",
      "title": "Lead & Job Assignment Rules",
      "content": "Telecallers receive new leads automatically (round-robin). Sales receives qualified or hot leads. HR receives new job applications instantly. Genie must follow internal assignment logic but provide clean responses to users without revealing internal workflows."
    },
    {
      "id": "crm_application_stage",
      "title": "Application Stage",
      "content": "During the application stage, Cloudora collects detailed context such as goals, problems, expected outcomes, competition details, and specific service needs. This helps sales prepare accurate proposals and execution teams prepare precise task lists."
    },
    {
      "id": "crm_agreement_stage",
      "title": "Agreement Stage",
      "content": "After sales verifies the application, Cloudora prepares a scope of work and agreement including deliverables, timeline, pricing, and terms. Genie may generate agreement drafts and send gentle reminders. When agreement is signed and payment is complete, the client becomes Active."
    },
    {
      "id": "crm_onboarding_overview",
      "title": "Onboarding Overview",
      "content": "Onboarding includes a welcome message, introduction to the assigned team, requirement checklist, timeline explanation, access sharing, resource collection and project planning. Genie helps ensure smooth onboarding and reminds the customer about missing items."
    },
    {
      "id": "crm_onboarding_checklist",
      "title": "Onboarding Resource Checklist",
      "content": "Checklist: Logo files, brand kit, website content, product details, login credentials, domain access, hosting access, reference websites, creative references, analytics access and any existing ad account details. Genie requests missing items at the right time."
    },
    {
      "id": "crm_delivery_overview",
      "title": "Delivery Phase Overview",
      "content": "Delivery includes: Requirements Complete → Work Started → First Review → Revision Phase → Final Output → Handover. Genie assists by communicating expectations, collecting feedback, and ensuring teams meet their timelines."
    },
    {
      "id": "crm_support_overview",
      "title": "Support Phase",
      "content": "Support includes bug fixes, maintenance, hosting issues, updates and optimization requests. Genie categorizes issues, creates support tickets, and escalates urgent matters to the technical team."
    },
    {
      "id": "crm_renewal_process",
      "title": "Renewal Process",
      "content": "Cloudora manages renewals for hosting plans, maintenance packages, marketing retainers and automation subscriptions. Genie sends reminders before due dates, offers updated plans and helps customers renew on time."
    },
    {
      "id": "crm_notifications",
      "title": "Notification Rules",
      "content": "Genie triggers reminders when: applications are incomplete, agreements pending, payments pending, onboarding resources missing, project stages delayed, or renewal deadlines near. Notifications maintain business momentum."
    },
    {
      "id": "crm_roles",
      "title": "Roles and Responsibilities",
      "content": "Telecaller: Contact leads, collect basic info. Sales: Qualification, consultation, proposal, agreement. HR: Job screening and interviews. Technical Team: Delivery and implementation. Creative Team: Content, design, editing. Support Team: Maintenance and issue resolution. Genie: AI assistant coordinating communication, collecting data, and providing guidance."
    },
    {
      "id": "crm_storage_rules",
      "title": "Attachment & Storage Rules",
      "content": "Cloudora stores documents using Supabase storage buckets such as catalogue_images, partner_uploads, resumes and creative_assets. Max file size: 50 MB. Allowed types: images, videos, PDFs and standard document files."
    }
  ]
}
