{
  "module": "jobs",
  "version": "2.0",
  "documents": [

    {
      "id": "jobs_overview",
      "title": "Cloudora Job Roles Overview",
      "content": "Cloudora operates multi-functional departments including Telecalling, Sales, Marketing, Technical Development, Creative, HR, Support, and Operations. Each role contributes to business growth and service delivery. Genie assists job seekers in understanding roles, applying correctly, and completing onboarding."
    },

    {
      "id": "application_fields",
      "title": "Job Application Fields",
      "content": "Genie collects the following fields for job applications: name, phone, email, city, interested_department, preferred_role, experience_years, languages, resume_link, expected_ctc, preferred_shift, work_hours, department_interest_notes."
    },

    {
      "id": "auto_matching_rules",
      "title": "Auto Matching Rules for Job Candidates",
      "content": "Genie matches candidates using weighted scoring: skill match (50%), location/city (20%), experience hints (20%), availability and shift compatibility (10%). Genie recommends the best-fit roles based on user responses."
    },

    {
      "id": "role_telecaller_domestic",
      "title": "Role: Telecaller (Domestic)",
      "content": "Department: Telecalling. Minimum Qualification: 10th. Required Skills: communication, basic computer. Responsibilities: outbound calling, lead qualification, follow-ups, CRM notes. KRAs: calls per day, lead qualification rate, follow-up completion, note accuracy."
    },

    {
      "id": "role_telecaller_international",
      "title": "Role: Telecaller (International)",
      "content": "Department: Telecalling. Minimum Qualification: 12th. Required Skills: strong English fluency, communication. Responsibilities: calling international leads, understanding requirements, routing qualified leads to sales. KRAs: qualification efficiency, language clarity, professionalism."
    },

    {
      "id": "role_lead_qualification_exec",
      "title": "Role: Lead Qualification Executive",
      "content": "Department: Sales. Skills: CRM knowledge, objection handling. Responsibilities: validate lead quality, gather requirement clarity, assign leads to correct pipeline stage. KRAs: qualification accuracy, CRM status updates, conversion handoff rate."
    },

    {
      "id": "role_followup_exec",
      "title": "Role: Follow-up Executive",
      "content": "Department: Sales. Skills: persistence, CRM accuracy. Responsibilities: timely follow-ups, maintaining warm leads, updating notes. KRAs: follow-up completion, engagement rate, timely updates."
    },

    {
      "id": "role_bde",
      "title": "Role: Business Development Executive",
      "content": "Department: Sales. Skills: closing, pitching, consultation. Responsibilities: pricing explanation, proposal creation, negotiation, closing. KRAs: revenue generated, proposals sent, closing ratio."
    },

    {
      "id": "role_bdm",
      "title": "Role: Business Development Manager",
      "content": "Department: Sales. Skills: strategy, team handling. Responsibilities: manage pipeline, monitor performance, strategic planning. KRAs: team closing rate, revenue growth, forecast accuracy."
    },

    {
      "id": "role_seo_exec",
      "title": "Role: SEO Executive",
      "content": "Department: Marketing. Skills: SEO, keyword research, content optimisation. Responsibilities: on-page SEO, off-page planning, technical audits. KRAs: ranking improvement, traffic growth, deliverable completion."
    },

    {
      "id": "role_social_media_exec",
      "title": "Role: Social Media Executive",
      "content": "Department: Marketing. Skills: content planning, creative coordination. Responsibilities: post scheduling, engagement tracking, content ideas. KRAs: consistency, engagement metrics, creative quality."
    },

    {
      "id": "role_ppc_exec",
      "title": "Role: PPC Ads Executive",
      "content": "Department: Marketing. Skills: Google Ads, Meta Ads. Responsibilities: ad setup, optimisation, reporting. KRAs: ROAS, CPL, conversion cost targets."
    },

    {
      "id": "role_content_writer",
      "title": "Role: Content Writer",
      "content": "Department: Marketing. Skills: writing, SEO keywords. Responsibilities: blogs, website content, scripts. KRAs: content quality, delivery speed, SEO relevance."
    },

    {
      "id": "role_web_dev",
      "title": "Role: Web Developer",
      "content": "Department: Technical. Skills: HTML, CSS, JS. Responsibilities: website development, landing pages, hosting setups. KRAs: code quality, delivery speed, bug-free execution."
    },

    {
      "id": "role_app_dev",
      "title": "Role: App Developer",
      "content": "Department: Technical. Skills: Flutter or React Native. Responsibilities: mobile app development, API integration. KRAs: performance, stability, timely releases."
    },

    {
      "id": "role_backend_dev",
      "title": "Role: Backend Developer",
      "content": "Department: Technical. Skills: Node.js, database management. Responsibilities: APIs, automation scripts, server logic. KRAs: uptime, error handling, response optimisation."
    },

    {
      "id": "role_uiux_designer",
      "title": "Role: UI/UX Designer",
      "content": "Department: Design. Skills: Figma, prototyping. Responsibilities: design wireframes, website UI, app UI. KRAs: design aesthetics, usability, feedback incorporation."
    },

    {
      "id": "role_video_editor",
      "title": "Role: Video Editor",
      "content": "Department: Creative. Skills: Premiere, After Effects. Responsibilities: reels, ads, promos. KRAs: creative quality, delivery speed, minimal revisions."
    },

    {
      "id": "role_graphic_designer",
      "title": "Role: Graphic Designer",
      "content": "Department: Creative. Skills: Photoshop, Illustrator. Responsibilities: branding, posters, social creatives. KRAs: branding consistency, visual quality."
    },

    {
      "id": "role_hr_recruiter",
      "title": "Role: HR Recruiter",
      "content": "Department: HR. Skills: sourcing, interviewing. Responsibilities: screening candidates, scheduling, onboarding. KRAs: hiring speed, talent quality."
    },

    {
      "id": "role_support_agent",
      "title": "Role: Client Support Agent",
      "content": "Department: Support. Skills: ticketing, communication. Responsibilities: issue resolution, hosting fixes, customer communication. KRAs: resolution time, customer satisfaction."
    },

    {
      "id": "role_product_manager",
      "title": "Role: Product Manager",
      "content": "Department: Operations. Skills: planning, feature roadmaps. Responsibilities: requirement gathering, documentation, sprint planning. KRAs: delivery smoothness, project clarity."
    },

    {
      "id": "role_qa_engineer",
      "title": "Role: QA Engineer",
      "content": "Department: Technical. Skills: testing, automation. Responsibilities: bug reporting, testing flows, quality checks. KRAs: bug coverage, testing accuracy."
    }

  ]
}
