{
  "module": "pricing",
  "version": "2.0",
  "documents": [

    {
      "id": "pricing_meta",
      "title": "Pricing Meta Configuration",
      "category": "pricing",
      "content": "Cloudora pricing uses INR as the primary currency. Multi-currency support is enabled. Frontend auto-converts prices into the user's detected currency using FX API while backend stores all values in INR. The system supports dynamic pricing factors like industry, urgency, and scope multipliers."
    },

    {
      "id": "pricing_dm_starter_visibility",
      "title": "Digital Marketing – Starter Visibility Pricing",
      "category": "pricing",
      "content": "DM Starter Visibility package pricing: Minimum INR 12000. Typical range INR 12000 to 18000. Premium range INR 20000 to 30000. Not shown directly to clients; Genie must ask budget. Employee view includes minimum and ranges. Dynamic rules: industry factor real estate 1.2, healthcare 1.2, local business 1.0, ecommerce 1.15. Urgency factor normal 1.0, urgent 1.15, same day 1.4. Scope factor small 1.0, medium 1.15, large 1.3."
    },

    {
      "id": "pricing_dm_growth_monthly",
      "title": "Digital Marketing – Growth Monthly Pricing",
      "category": "pricing",
      "content": "DM Growth Monthly package pricing: Minimum INR 29000. Typical range INR 29000 to 42000. Premium range INR 45000 to 70000. Dynamic rules include industry factor ecommerce 1.2, SaaS 1.25; urgency factor normal 1.0, urgent 1.2; scope small 1.0, medium 1.15, large 1.35. This is a customized service requiring full requirement understanding."
    },

    {
      "id": "pricing_dm_performance_max",
      "title": "Digital Marketing – Performance Max Pricing",
      "category": "pricing",
      "content": "DM Performance Max pricing: Minimum INR 49000. Typical range INR 49000 to 80000. Premium range INR 80000 to 150000. For high-intensity ads and CRO. Dynamic rules: ecommerce 1.2, SaaS 1.3; urgency 1.25 for urgent work; scope factor up to 1.4 for large requirements."
    },

    {
      "id": "pricing_dm_whatsapp_outreach",
      "title": "Digital Marketing – WhatsApp Outreach Pricing",
      "category": "pricing",
      "content": "DM WhatsApp Outreach pricing: Minimum INR 9999. Typical range INR 9999 to 14999. Premium range INR 15000 to 30000. Includes message volume based adjustments. Dynamic rules: urgency factor 1.1 for urgent, and scope factor 1.2 for large datasets."
    },

    {
      "id": "pricing_dm_email_funnel",
      "title": "Digital Marketing – Email Funnel Pricing",
      "category": "pricing",
      "content": "Email Funnel pricing: Minimum INR 14999. Typical range INR 14999 to 24999. Premium range INR 25000 to 45000. No fixed price shown to clients; Genie must ask budget and match scope."
    },

    {
      "id": "pricing_website_starter",
      "title": "Website – Starter Pricing",
      "category": "pricing",
      "content": "Website Starter pricing: Minimum INR 14999. Typical range INR 14999 to 39999. Premium range INR 40000 to 80000. Dynamic rules: ecommerce industry factor 1.1, SaaS 1.2. Urgency adds 20 percent for expedited timelines. Scope varies by page count and custom functionality."
    },

    {
      "id": "pricing_website_business",
      "title": "Website – Business Package Pricing",
      "category": "pricing",
      "content": "Website Business package pricing: Minimum INR 29999. Typical range INR 29999 to 79999. Premium range INR 80000 to 200000. Used for custom UI/UX, complex structures, integrations, and performance work."
    },

    {
      "id": "pricing_app_starter",
      "title": "App Development – Starter Pricing",
      "category": "pricing",
      "content": "App Starter pricing: Minimum INR 75000. Typical range INR 75000 to 150000. Premium range INR 150000 to 400000. For MVPs, single-platform apps, and basic backend. Price depends heavily on integrations and design depth."
    },

    {
      "id": "pricing_game_prototype",
      "title": "Game Development – Prototype Pricing",
      "category": "pricing",
      "content": "Game Prototype pricing: Minimum INR 125000. Typical range INR 125000 to 250000. Premium range INR 250000 to 600000. Scope includes core mechanics, sample art assets, and playable builds."
    },

    {
      "id": "pricing_game_full_production",
      "title": "Game Development – Full Production Pricing",
      "category": "pricing",
      "content": "Game Full Production pricing: Minimum INR 400000. Typical range INR 400000 to 800000. Premium range INR 800000 to 2000000. This applies to full game builds with levels, multiplayer (if required), custom art, animations, and backend servers."
    },

    {
      "id": "pricing_ai_chatbot",
      "title": "AI Chatbot Development Pricing",
      "category": "pricing",
      "content": "AI Chatbot pricing: Minimum INR 50000. Typical range INR 50000 to 120000. Premium range INR 120000 to 300000. Depends on automation complexity, integration count, backend workflows, and number of intents."
    },

    {
      "id": "pricing_blockchain_audit",
      "title": "Blockchain Audit Pricing",
      "category": "pricing",
      "content": "Blockchain Audit pricing: Minimum INR 75000. Typical range INR 75000 to 150000. Premium range INR 150000 to 400000. Audit scope includes smart contract testing, security review, and vulnerability reporting."
    },

    {
      "id": "pricing_nft_starter",
      "title": "NFT Starter Pricing",
      "category": "pricing",
      "content": "NFT Starter pricing: Minimum INR 60000. Typical range INR 60000 to 120000. Premium range INR 120000 to 300000. Includes smart contract, metadata generation, and basic minting website."
    },

    {
      "id": "pricing_creative_logo_video",
      "title": "Branding – Logo + Video Pricing",
      "category": "pricing",
      "content": "Creative Logo + Video pricing: Minimum INR 4999. Typical range INR 4999 to 14999. Premium range INR 15000 to 50000. Depends on custom design complexity, animation styles, and number of revisions."
    },

    {
      "id": "pricing_global_notes",
      "title": "Global Currency Notes",
      "category": "pricing",
      "content": "Cloudora uses INR internally. Frontend auto-converts to USD, EUR, or local currency using FX provider API. Default FX placeholders: USD 0.012, EUR 0.011. Actual conversion is fetched dynamically during quotation generation."
    },

    {
      "id": "pricing_negotiation_rules",
      "title": "Negotiation & Discount Rules",
      "category": "pricing",
      "content": "Cloudora discount brackets are 10%, 20%, and 40%. Any discount above 20 percent requires manager approval. Prices cannot go below the minimum defined price. Genie must never show internal margins but may ask for budget and align scope."
    },

    {
      "id": "pricing_auto_update_rules",
      "title": "Pricing Auto-Update Algorithm Rules",
      "category": "pricing",
      "content": "The pricing system supports semi-automatic updates. Rules include: increase prices if enquiries rise more than 20 percent in 30 days; reduce typical range if conversions drop below 5 percent; increase minimum price if workload increases by 30 percent. Admin approval is required before applying updates."
    }

  ]
}
