{
  "module": "soft_skills",
  "version": "1.0",
  "documents": [

    {
      "id": "soft_skills_overview",
      "title": "Soft Skills Overview",
      "category": "soft_skills",
      "content": "Soft skills improve communication, productivity, teamwork, and customer experience. Genie helps employees learn daily communication, clarity, confidence, listening, empathy, and problem-solving.",
      "metadata": {}
    },

    {
      "id": "communication_basics",
      "title": "Communication Basics",
      "category": "soft_skills",
      "content": "All employees must follow: speak clearly, use short sentences, avoid assumptions, ask clarifying questions, respond politely, and keep conversation structured. Never sound rude, confused, or unprepared.",
      "metadata": {}
    },

    {
      "id": "professional_tone_rules",
      "title": "Professional Tone Rules",
      "category": "soft_skills",
      "content": "Tone must remain polite, confident, and supportive. Avoid slang, anger, sarcasm or too casual language. Written messages must be clear, grammar-correct, and action-focused.",
      "metadata": {}
    },

    {
      "id": "active_listening",
      "title": "Active Listening Skills",
      "category": "soft_skills",
      "content": "Employees should listen fully, avoid interrupting, confirm understanding, repeat back key points, and ask structured follow-up questions. Genie coaches employees to improve listening style.",
      "metadata": {}
    },

    {
      "id": "customer_empathy",
      "title": "Customer Empathy Rules",
      "category": "soft_skills",
      "content": "Empathy means understanding the customer's feelings and needs. Employees must acknowledge concerns, show understanding, avoid blame, and provide solutions calmly.",
      "metadata": {}
    },

    {
      "id": "problem_solving_framework",
      "title": "Problem Solving Framework",
      "category": "soft_skills",
      "content": "Genie provides: 1) Identify the issue, 2) Confirm understanding, 3) Suggest solutions, 4) Explain benefits, 5) Close with reassurance. This framework reduces confusion and increases productivity.",
      "metadata": {}
    },

    {
      "id": "time_management",
      "title": "Time Management Skills",
      "category": "soft_skills",
      "content": "Employees must prioritise tasks, avoid multitasking, block work time, reduce distractions, update CRM on time, fulfil deadlines, and maintain discipline. Genie creates structured day plans.",
      "metadata": {}
    },

    {
      "id": "stress_management",
      "title": "Stress Management Guidance",
      "category": "soft_skills",
      "content": "Genie supports employees with calming techniques, positive reminders, micro-break suggestions, and supportive messages. Mistakes are learning opportunities, not failures.",
      "metadata": {}
    }

  ]
}
