{
  "module": "support",
  "version": "2.0",
  "documents": [

    {
      "id": "support_overview",
      "title": "Support System Overview",
      "category": "support",
      "content": "Cloudora's support system manages all customer issues after delivery. Support includes bug fixes, minor updates, hosting issues, optimization tasks, content corrections, and performance improvements. The goal is fast issue resolution, clear communication, and long-term customer satisfaction. Genie assists by collecting details, categorizing issues, and guiding the user through the process.",
      "metadata": {}
    },

    {
      "id": "support_ticket_categories",
      "title": "Types of Support Tickets",
      "category": "support",
      "content": "Support tickets are categorized as follows: Technical Issues (bugs, errors, API failures, deployment issues), Content Requests (text changes, image replacement), Design Corrections (alignment issues, layout adjustments), Hosting Issues (SSL, DNS, downtime), Performance Issues (speed, caching, load time), App Issues (crashes, malfunctioning features). Each category has a predefined handling workflow.",
      "metadata": {}
    },

    {
      "id": "support_ticket_categories_extended",
      "title": "System Ticket Categories (System-Level)",
      "category": "support",
      "content": "System-level ticket categories: Billing, Delivery, Technical, Creative, and General Query. Cloudora's internal router automatically assigns tickets to the correct team based on detected product ID, user message context, and issue type.",
      "metadata": {}
    },

    {
      "id": "support_severity_levels",
      "title": "Support Severity Levels",
      "category": "support",
      "content": "Severity Levels: Critical — system down, payment failure, or major bug affecting business; High — core features not working but system is active; Medium — design issues or content corrections; Low — minor cosmetic changes or general queries. Critical issues require immediate attention; lower severity issues follow normal SLA cycles.",
      "metadata": {}
    },

    {
      "id": "support_sla_timelines",
      "title": "Support SLA Timelines",
      "category": "support",
      "content": "Cloudora SLA timelines: Critical issues must be acknowledged within 15 minutes and resolved within 2–6 hours. High severity issues resolved within 24–48 hours. Medium severity issues resolved within 2–4 days. Low severity issues resolved within 5–7 days. Genie helps in SLA communication and expectation management.",
      "metadata": {}
    },

    {
      "id": "support_sla_system_defaults",
      "title": "System-Level SLA Defaults",
      "category": "support",
      "content": "System SLA settings: Normal — 72 hours; Priority — 24 hours; Critical — 4 hours. If a priority ticket remains unresolved for over 48 hours, it is automatically escalated and a manager is notified.",
      "metadata": {}
    },

    {
      "id": "support_issue_information",
      "title": "Information Required to Report an Issue",
      "category": "support",
      "content": "To diagnose issues efficiently, support requires: a clear description, screenshot or screen recording, URL of the affected page, device and browser information, steps to reproduce, and expected behavior. Genie must always collect these details before ticket creation.",
      "metadata": {}
    },

    {
      "id": "support_workflow_steps",
      "title": "Support Workflow Steps",
      "category": "support",
      "content": "Support workflow: 1) User reports issue. 2) Genie collects required information. 3) Issue is categorized. 4) Severity is assigned. 5) Ticket is routed to developer, creative, or support agent. 6) Work begins and SLA is tracked. 7) Resolution is delivered. 8) Customer confirms. 9) Ticket is closed and logged in CRM.",
      "metadata": {}
    },

    {
      "id": "support_common_issues_list",
      "title": "Common Support Issues",
      "category": "support",
      "content": "Frequent support issues: broken links or pages, slow website loading, incorrect text or images, missing or misplaced design elements, form submissions not working, DNS/hosting downtime, email not receiving, SEO tags missing, mobile layout issues, automation failures, chatbot issues.",
      "metadata": {}
    },

    {
      "id": "support_escalation_rules",
      "title": "Support Escalation Rules",
      "category": "support",
      "content": "Escalation occurs when: the issue deadline is near, the customer reports repeated errors, the issue affects business operations, or the task exceeds first-level support capability. Escalated tickets are forwarded to the technical lead or admin. Priority issues automatically notify the manager.",
      "metadata": {}
    },

    {
      "id": "support_refund_policy",
      "title": "Support Refund & Satisfaction Policy",
      "category": "support",
      "content": "Cloudora offers a 7-day satisfaction guarantee under specific conditions: work must have been delivered, the client must request within 7 days, and the request must not be due to scope changes or new requirements. Genie must communicate conditions clearly without promising automatic refunds.",
      "metadata": {}
    },

    {
      "id": "support_communication_guidelines",
      "title": "Support Communication Guidelines",
      "category": "support",
      "content": "Support communication must be friendly, respectful, and structured. Never blame the customer. Always explain the issue clearly, provide timelines, share updates, confirm resolution, and offer guidance on preventing future issues. Genie represents Cloudora's tone and professionalism.",
      "metadata": {}
    },

    {
      "id": "support_self_help_faqs",
      "title": "Self-Help FAQs",
      "category": "support",
      "content": "Common FAQs include: How long does the starter website take? Answer: 7–21 days depending on approvals. How to share project assets? Answer: Upload using the Supabase lead portal; supported types include jpeg, png, mp4, and pdf.",
      "metadata": {}
    },

    {
      "id": "support_post_resolution_steps",
      "title": "Post-Resolution Steps",
      "category": "support",
      "content": "After issue resolution, support must: update CRM logs, close the ticket, verify related systems, confirm with the customer, and provide preventive recommendations. Genie summarises the resolved issue and keeps short-term memory for context during future interactions.",
      "metadata": {}
    },

    {
      "id": "support_internal_notes",
      "title": "Internal Support Notes",
      "category": "support",
      "content": "Support tickets automatically route based on the detected product ID, ticket category, and severity. Genie assists employees by pre-filling relevant metadata. Asset uploads follow Supabase rules: 50MB max, allowed file types jpeg/png/mp4/pdf.",
      "metadata": {}
    }

  ]
}
